000_РОЗНИЦА_ЦЕНТР/src/Documents/ВозвратИнтернетЗаказа/ВозвратИнтернетЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратИнтернетЗаказа</name>
  <basedOn>Document.ЭлектроннаяНакладная</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <attributes>
    <name>ВладелецДисконтнойКарты</name>
    <comment>на 25.10.2018 не использовался - нужно заменить на чтонить полезное</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкиРассчитаны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВозвратаЗаказаПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВозврата</name>
    <type>
      <types>EnumRef.ТипыВозвратаИнтернетЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяНакладная</name>
    <type>
      <types>DocumentRef.ЭлектроннаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВозвращенноеКоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиЗапросаДоступности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловСписано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОкругления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаЗаказа</name>
    <attributes>
      <name>НомерОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.ВидыОплатыЗаказаПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипОплатыЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОплаты</name>
      <type>
        <types>EnumRef.СтатусОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменён</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДОплаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СостояниеСтрокЗаказаПокупателя/СостояниеСтрокЗаказаПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеСтрокЗаказаПокупателя</name>
  <resources>
    <name>ГотовКПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Продано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Получен</name>
    <comment>Получен в магазине по перемещению внутренняя логистика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отправлен</name>
    <comment>Отправлен из магазина по перемещению внутренняя логистика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Доставлено</name>
    <comment>Доставлено клиенту службой доставки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <comment>Согласован запрос доступности в магазине</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Выдано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СогласованоВNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтароеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НовоеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючСвязиЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗапросДоступностиТоваров</name>
    <type>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСвязи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыВозвратаЗаказаПокупателя/СтатусыВозвратаЗаказаПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВозвратаЗаказаПокупателя</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Чек</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыВозвратаИнтернетЗаказа/ТипыВозвратаИнтернетЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВозвратаИнтернетЗаказа</name>
  <enumValues>
    <name>АвтоВозврат</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ВозвратИнтернетЗаказа/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектроннаяНакладная") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ТаблицаСостоянияСтрок.КлючСвязи,
			|	ТаблицаСостоянияСтрок.КлючСвязиЗаказа,
			|	ТаблицаСостоянияСтрок.ЗаказПокупателя,
			|	ТаблицаСостоянияСтрок.ЗапросДоступностиТоваров
			|ПОМЕСТИТЬ ДанныеДляВозврата
			|ИЗ
			|	Документ.ЭлектроннаяНакладная КАК ТаблицаЭНВозврата
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяНакладная КАК ТаблицаЭН
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСтрокЗаказаПокупателя КАК ТаблицаСостоянияСтрок
			|			ПО ТаблицаЭН.ЗаказПокупателя = ТаблицаСостоянияСтрок.ЗаказПокупателя
			|			И ТаблицаЭН.ДокументОснование = ТаблицаСостоянияСтрок.ЗапросДоступностиТоваров
			|		ПО ТаблицаЭНВозврата.ДокументОснование = ТаблицаЭН.Ссылка
			|ГДЕ
			|	ТаблицаЭНВозврата.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ТаблицаТоваров.Ссылка,
			|	ТаблицаТоваров.НомерСтроки,
			|	ТаблицаТоваров.АкционнаяЦена,
			|	ТаблицаТоваров.БонусАкцияНачислен,
			|	ТаблицаТоваров.БонусАкцияСписан,
			|	ТаблицаТоваров.БонусБазаНачислен,
			|	ТаблицаТоваров.БонусБазаСписан,
			|	ТаблицаТоваров.КлючСвязи,
			|	ТаблицаТоваров.КлючСвязиБонусныхБаллов,
			|	ТаблицаТоваров.КлючСвязиЗапросаДоступности,
			|	ТаблицаТоваров.КлючСвязиСерийныхНомеров,
			|	ТаблицаТоваров.КодСтроки,
			|	ТаблицаТоваров.Количество,
			|	ТаблицаТоваров.КоличествоУпаковок,
			|	ТаблицаТоваров.МагазинПолучатель,
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Обеспечение,
			|	ТаблицаТоваров.Отменено,
			|	ТаблицаТоваров.ПричинаОтмены,
			|	ТаблицаТоваров.ПричинаРучнойСкидки,
			|	ТаблицаТоваров.Продавец,
			|	ТаблицаТоваров.ПродажаПодарка,
			|	ТаблицаТоваров.ПроцентАвтоматическойСкидки,
			|	ТаблицаТоваров.ПроцентРучнойСкидки,
			|	ТаблицаТоваров.Резервировать,
			|	ТаблицаТоваров.Самовывоз,
			|	ТаблицаТоваров.Склад,
			|	ТаблицаТоваров.Содержание,
			|	ТаблицаТоваров.СтавкаНДС,
			|	ТаблицаТоваров.Сумма,
			|	ТаблицаТоваров.СуммаАвтоматическойСкидки,
			|	ТаблицаТоваров.СуммаБонусныхБалловНачислено,
			|	ТаблицаТоваров.СуммаБонусныхБалловСписано,
			|	ТаблицаТоваров.СуммаНДС,
			|	ТаблицаТоваров.СуммаОкругления,
			|	ТаблицаТоваров.СуммаРучнойСкидки,
			|	ТаблицаТоваров.ТипДоставки,
			|	ТаблицаТоваров.УникальныйИдентификатор,
			|	ТаблицаТоваров.Упаковка,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.Цена
			|ИЗ
			|	Документ.ЗаказПокупателя.Товары КАК ТаблицаТоваров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляВозврата КАК ДанныеДляВозврата
			|		ПО ТаблицаТоваров.Ссылка = ДанныеДляВозврата.ЗаказПокупателя
			|		И ТаблицаТоваров.КлючСвязи = ДанныеДляВозврата.КлючСвязиЗаказа
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ТаблицаЗаказа.Контрагент КАК Контрагент,
			|	таблицазаказа.ДисконтнаяКарта КАК ДисконтнаяКарта,
			|	ТаблицаЗаказа.Ссылка КАК ДокументОснование,
			|	ЗНАЧЕНИЕ(Перечисление.СтатусыВозвратаЗаказаПокупателя.Новый) КАК Статус,
			|	ЗНАЧЕНИЕ(Перечисление.ТипыВозвратаИнтернетЗаказа.АвтоВозврат) КАК ТипВозврата,
			|	ТаблицаЗаказа.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
			|	ТаблицаЗаказа.Магазин КАК Магазин,
			|	ТаблицаЗаказа.Организация КАК Организация
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ТаблицаЗаказа
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляВозврата КАК ДанныеДляВозврата
			|		ПО ДанныеДляВозврата.ЗаказПокупателя = ТаблицаЗаказа.Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = РезультатЗапроса[1].Выгрузить();
		Товары.Загрузить(Выборка);

		Выборка = РезультатЗапроса[2].Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ТаблицаЗаказа.Контрагент КАК Контрагент,
			|	таблицазаказа.ДисконтнаяКарта КАК ДисконтнаяКарта,
			|	ТаблицаЗаказа.Ссылка КАК ДокументОснование,
			|	ЗНАЧЕНИЕ(Перечисление.СтатусыВозвратаЗаказаПокупателя.Новый) КАК Статус,
			|	ЗНАЧЕНИЕ(Перечисление.ТипыВозвратаИнтернетЗаказа.АвтоВозврат) КАК ТипВозврата,
			|	ТаблицаЗаказа.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
			|	ТаблицаЗаказа.Магазин КАК Магазин,
			|	ТаблицаЗаказа.Организация КАК Организация
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ТаблицаЗаказа
			|ГДЕ
			|	ТаблицаЗаказа.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
